IDEA Open Model
TypeClassEvaluation Enumeration
Compatible with IDEA StatiCa 20.1
 Load of evaluation
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum TypeClassEvaluation
Public Enumeration TypeClassEvaluation
Members
Member name | Value | Description
eLoadCase | 0 |  LoadCase
eLinCombi | 1 |  LinCombi
eNonLinCombi | 2 |  NonLinCombi
See Also
Reference
IdeaRS.OpenModel.Loading Namespace